<template>
    <div class="pb-4">
        <div class="postImg mb-2 ">
            <v-img :src="post.postImg" alt="user" aspect-ratio="1.4" height="200"></v-img>
            <div class="postCategory font-weight-bold mx-3">{{ post.postCategory }}</div>
        </div>
        <v-container fluid>

            <div class="postTitle text-xs-right my-3">
                <h1>{{ post.postTitle }}</h1>
            </div>

            <v-layout row align-center class="my-4">

                <v-flex shrink>
                    <v-avatar size="28" color="primary">
                        <img src="../../assets/img/avatar.png" alt="user">
                    </v-avatar>
                    <span class="gray--text font-weight-bold mx-2 body-1">زيد حسان</span>
                </v-flex>

                <v-spacer></v-spacer>

                <v-flex shrink>
                    <span>30-JULY</span>
                </v-flex>
            </v-layout>
            <div class="postContent text-xs-right my-4 body-1">
                <article>
                    هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث
                    يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها
                    التطبيق.
                    إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن
                    يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج
                    العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
                    ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى
                    أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا
                    يليق.
                    هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو
                    حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.

                    هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث
                    يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها
                    التطبيق.
                    إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن
                    يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج
                    العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
                    ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى
                    أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا
                    يليق.
                    هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو
                    حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.

                    هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث
                    يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها
                    التطبيق.
                    إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن
                    يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج
                    العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
                    ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى
                    أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا
                    يليق.
                    هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو
                    حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.

                    هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث
                    يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها
                    التطبيق.
                    إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن
                    يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج
                    العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
                    ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى
                    أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا
                    يليق.
                    هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو
                    حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.
                </article>
            </div>


            <v-bottom-nav color="white" :value="true" dark fixed class="mb-5">
                <v-btn dark fab icon small flat color="accent lighten-3">
                    <v-icon class="accent--text">fas fa-thumbs-up</v-icon>
                </v-btn>


                <v-btn dark fab icon small flat color="error lighten-3">
                    <v-icon class="error--text">fas fa-heart</v-icon>
                </v-btn>

                <v-btn dark icon small flat color="yellow lighten-3">
                    <v-icon class="yellow--text darken-1">fas fa-bookmark</v-icon>
                </v-btn>
            </v-bottom-nav>
        </v-container>

    </div>
</template>

<script>
    import {
        mapGetters
    } from 'vuex'

    export default {
        data() {
            return {}
        },
        computed: {
            post() {
                const id = parseInt(this.$route.params.id);
                return this.$store.state.altjarub.filter(function (tejrba) {
                    return tejrba.postID === id;
                })[0];
            }
        },
    }
</script>

<style lang="scss" scoped>
    @import '../../styles/views/singlePostPage/singlePostPage';
</style>